import { createStore } from 'vuex'
import { ref } from "vue";

const myStore = createStore({
  state () {
    return {
      company:{},
      report: {},
      trans: {},
      trans_detail: [],
      consumables_detail: [],
      EF_co2: {
        "汽油": 0.002221059456,
        "柴油": 0.0026419028944,
        "液化天然气": 0.00099988194636
      },
      EF_ch4:{
        "轻型货车":{
          "汽油": 0.0000015903,
          "柴油": 0,
        },
        "重型货车":{
          "汽油": 0.000003906,
          "柴油": 0.0000048825,
          "液化天然气": 0.00002511,
        },
      },
      EF_n2o:{
        "轻型货车":{
          "汽油": 0.000004368,
          "柴油": 0.000004095,
        },
        "重型货车":{
          "汽油": 0.000001638,
          "柴油": 0.00000819,
          "液化天然气": 0,
        },
      },
      EF_fossil: {
        "无烟煤": 0.524667542,
        "烟煤": 0.476478618,
        "褐煤": 0.3784704,
        "洗精煤": 0.62196726,
        "其他洗煤": 0.1911096,
        "煤制品": 0.5279904,
        "焦炭": 0.7778799,
        "原油": 0.83952876,
        "燃料油": 0.83104882,
        "汽油": 0.8297856,
        "柴油": 0.85776068,
        "一般煤油": 0.859558,
        "石油焦": 0.83545,
        "其它石油制品": 0.787724,
        "焦油": 0.72124668,
        "粗苯": 0.930238736,
        "炼厂干气": 0.8297289,
        "液化石油气": 0.80559468,
        "液化天然气": 0.634174596,
        "天然气": 5.89687857,
        "焦炉煤气": 2.340770256,
        "高炉煤气": 2.64176748,
        "转炉煤气": 3.90573216,
        "密闭电石炉炉气": 4.349185731,
      },
      EF_elec:{
        "全国":0.581,
        "北京":0.584,
        "天津":0.721,
        "河北":0.842,
        "山西":0.748,
        "内蒙古":0.898,
        "山东":0.712,
        "辽宁":0.761,
        "吉林":0.823,
        "黑龙江":0.783,
        "上海":0.42,
        "江苏":0.652,
        "浙江":0.49,
        "安徽":0.702,
        "福建":0.433,
        "江西":0.607,
        "河南":0.67,
        "湖北":0.377,
        "湖南":0.471,
        "重庆":0.423,
        "四川":0.126,
        "广东":0.41,
        "广西":0.455,
        "贵州":0.106,
        "云南":0.463,
        "海南":0.447,
        "陕西":0.579,
        "甘肃":0.398,
        "青海":0.115,
        "宁夏":0.711,
        "新疆":0.676,
      },
      EF_paper: 0.378,
      EF_pla: 0.3705,
      EF_alum: 0.725,
      m: 8,
      D_T: 20,
      EM_base1: 0,
      unitEnergyConsume:{
        "柴油": 0.054,
        "汽油": 0.069
      },
      EF_chemi: {
        "氢氧化钠(50%)": 0.424,
        "氢氧化钠(100%)": 0.846,
        "其他药剂": 1.6,
        "无": 0,
      },
      EM_transport: "",
      EM_process: "",
      EM_recyc: "",
    }
  },
  mutations: {
    changeMsg(state,company) {
      state.company = company;
    }
  }
})

export default myStore;

